export default {
  //通用步骤
  "-16000": {
    "type": "error",		//警告:"warning"  错误:"error"  为空则不显示
    "title": "",		//前端展示用户错误提示框标题
    "info": "未登录",	        //前端展示用户提示内容
    "note": "未登录",	        //记录问题注解
    "steps": ""		//步骤  为空则为通用状态
  },
  //1.登录步骤
  "10001": {
    "type": "tip",		//类型: 提示:"tip"  为空则不显示
    "title": "",		//前端展示用户错误提示框标题
    "info": "登录成功",	//前端展示用户提示内容
    "note": "登录成功",	//记录注解
    "steps": "登录步骤"	//步骤  为空则为通用状态
  },
  "-10001": {
    "type": "error",
    "title": "登录失败",
    "info": "验证码错误",
    "note": "验证码错误",
    "steps": "登录步骤"
  },
  "-10002": {
    "type": "error",
    "title": "登录失败",
    "info": "无效验证码",
    "note": "无效验证码",
    "steps": "登录步骤"
  },
  "-10003": {
    "type": "error",
    "title": "登录失败",
    "info": "无此用户",
    "note": "无此用户",
    "steps": "登录步骤"
  },
  "-10004": {
    "type": "error",
    "title": "登录失败",
    "info": "密码错误",
    "note": "密码错误",
    "steps": "登录步骤"
  },
  "-10005": {
    "type": "error",
    "title": "登录失败",
    "info": "密码错误",
    "note": "密码错误",
    "steps": "登录步骤"
  },
  "-10006": {
    "type": "error",
    "title": "登录失败",
    "info": "登录异常,请重新登录",
    "note": "登录步骤操作数据库异常",
    "steps": "登录步骤"
  },
  "-10007": {
    "type": "error",
    "title": "登录失败",
    "info": "获取用户信息失败",
    "note": "登录步骤获取设备组列表操作数据库异常",
    "steps": "登录步骤"
  },
  "-10008": {
    "type": "error",
    "title": "登录失败",
    "info": "获取用户信息失败",
    "note": "登录步骤获取设备组列表操作数据库异常",
    "steps": "登录步骤"
  },

  //2.修改密码步骤
  "10021": {
    "type": "tip",		//类型: 提示:"tip"  为空则不显示
    "title": "",		//前端展示用户错误提示框标题
    "info": "修改密码成功",	//前端展示用户提示内容
    "note": "修改密码成功",	//记录注解
    "steps": "修改密码步骤"	//步骤  为空则为通用状态
  },
  "-10021": {
    "type": "error",
    "title": "",
    "info": "验证码错误",
    "note": "验证码错误",
    "steps": "修改密码步骤"
  },
  "-10022": {
    "type": "error",
    "title": "",
    "info": "无效验证码",
    "note": "无效验证码",
    "steps": "修改密码步骤"
  },
  "-10023": {
    "type": "error",
    "title": "",
    "info": "无此用户",
    "note": "无此用户",
    "steps": "修改密码步骤"
  },
  "-10024": {
    "type": "error",
    "title": "",
    "info": "密码错误",
    "note": "密码错误",
    "steps": "修改密码步骤"
  },
  "-10025": {
    "type": "error",
    "title": "",
    "info": "修改密码失败",
    "note": "修改密码步骤时操作数据库异常",
    "steps": "修改密码步骤"
  },

  //3.获取用户信息步骤
  "10041": {
    "type": "tip",
    "title": "",
    "info": "获取用户信息成功",
    "note": "获取用户信息成功",
    "steps": "获取用户信息步骤"
  },
  "-10041": {
    "type": "error",
    "title": "",
    "info": "获取用户信息失败",
    "note": "获取用户信息步骤时操作数据库异常",
    "steps": "获取用户信息步骤"
  },

  //4.登出步骤
  "10051": {
    "type": "tip",
    "title": "",
    "info": "登出成功",
    "note": "登出成功",
    "steps": "登出步骤"
  },
  "-10051": {
    "type": "error",
    "title": "",
    "info": "登出失败",
    "note": "登出步骤回收资料操作失败",
    "steps": "登出步骤"
  }
};